       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGQ0007.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT STUDENTS-FILE ASSIGN TO "STUDENTS_INDEXED.DAT"
        FILE STATUS IS FILE-CHECK-KEY
        ORGANISATION IS INDEXED
        ACCESS IS DYNAMIC
        RECORD KEY IS STUDENT-ID
        ALTERNATE RECORD KEY IS INCLUSION-DATE WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENTS-FILE.
       01 STUDENT-DATA.
           88 END-OF-FILE VALUE HIGH-VALUE.
           05 STUDENT-ID PIC 9(4).
           05 STUDENT-NAME PIC X(25).
           05 STUDENT-BIRTHDAY PIC 9(8).
           05 STUDENT-COURSE PIC X(15).
           05 INCLUSION-DATE PIC 9(8).
           05 UPDATE-DATE PIC 9(8).
       WORKING-STORAGE SECTION.
       01 WS-AREA.
           05 FILE-CHECK-KEY PIC X(2).
           05 TITLE.
               10 TITLE-TOP PIC X(46)
                VALUE "+--------------------------------------------+".
               10 TITLE-MIDDLE PIC X(46)
                VALUE "|     QUERY STUDENT BY DATE OF INCLUSION     |".
               10 TITLE-BOTTOM PIC X(46)
                VALUE "+--------------------------------------------+".
           05 PROMPTS.
               10 PROMPT-INCLUSION-DATE PIC X(41)
                VALUE "ENTER THE DATE OF INCLUSION (YYYYMMDD) >>".
           05 DETAIL-REPORT.
            10 REPORT-SEPARATOR PIC X(91) VALUE "-----------------------
      -        "------------------------------------------------------".
            10 REPORT-TITLE.
                15 FILLER PIC X(30)
                 VALUE "LIST OF STUDENTS INCLUDED ON: ".
                15 REPORT-INCLUSION-MONTH PIC 99.
                15 FILLER PIC X VALUE "/".
                15 REPORT-INCLUSION-DATE PIC 99.
                15 FILLER PIC X VALUE "/".
                15 REPORT-INCLUSION-YEAR PIC 9(4).
            10 REPORT-HEADER.
               15 FILLER PIC X VALUE SPACES.
               15 FILLER PIC X(2) VALUE "ID".
               15 FILLER PIC X(3) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(12) VALUE "STUDENT NAME".
               15 FILLER PIC X(14) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(8) VALUE "BIRTHDAY".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(6) VALUE "COURSE".
               15 FILLER PIC X(10) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(11) VALUE "UPDATE DATE".
               15 FILLER PIC X(1) VALUE SPACES.
             10 REPORT-RECORD.
               15 FILLER PIC X VALUE SPACES.
               15 REPORT-STUDENT-ID PIC 9(4).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-STUDENT-NAME PIC X(25).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-STUDENT-BDAY PIC 9(8).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-COURSE PIC X(15).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-REC-UPDATE-DATE PIC 9(8).
               15 FILLER PIC X(4) VALUE SPACES.
               15 FILLER PIC X(4) VALUE SPACES.
             10 REPORT-TOTAL-LINE.
               15 FILLER PIC X(17) VALUE "TOTAL RECORDS : ".
               15 REPORT-TOTAL PIC ZZ9.
           05 WS-QUERY-INCLUSION-DATE.
            10 WS-INCLUSION-YEAR PIC 9(4).
            10 WS-INCLUSION-MONTH PIC 9(2).
            10 WS-INCLUSION-DAY PIC 9(2).
           05 WS-STUDENT-COUNT PIC 999.
       PROCEDURE DIVISION.
       0100-START.
           OPEN INPUT STUDENTS-FILE.
           IF(FILE-CHECK-KEY NOT= "00")
               DISPLAY "ERROR OPENING FILE, STATUS", FILE-CHECK-KEY
               PERFORM 9000-END-PROGRAM
           END-IF.
           PERFORM 0200-DISPLAY-TITLE.
           DISPLAY SPACES.
           PERFORM 0300-PROMPT-INCLUSION-DATE.
           DISPLAY SPACES.
           PERFORM 0400-DISPLAY-REPORT.
           PERFORM 9000-END-PROGRAM.
       0200-DISPLAY-TITLE.
           DISPLAY TITLE-TOP.
           DISPLAY TITLE-MIDDLE.
           DISPLAY TITLE-BOTTOM.
       0300-PROMPT-INCLUSION-DATE.
           DISPLAY PROMPT-INCLUSION-DATE.
           ACCEPT WS-QUERY-INCLUSION-DATE.
       0400-DISPLAY-REPORT.
           MOVE WS-INCLUSION-YEAR TO REPORT-INCLUSION-YEAR.
           MOVE WS-INCLUSION-MONTH TO REPORT-INCLUSION-MONTH.
           MOVE WS-INCLUSION-DAY TO REPORT-INCLUSION-DATE.
           DISPLAY REPORT-TITLE.
           DISPLAY REPORT-SEPARATOR.
           DISPLAY REPORT-HEADER.
           DISPLAY REPORT-SEPARATOR.
           PERFORM 0500-DISPLAY-STUDENTS.
           DISPLAY REPORT-SEPARATOR.
           DISPLAY SPACES.
           MOVE WS-STUDENT-COUNT TO REPORT-TOTAL.
           DISPLAY REPORT-TOTAL-LINE.
       0500-DISPLAY-STUDENTS.
           MOVE WS-QUERY-INCLUSION-DATE TO INCLUSION-DATE.
           READ STUDENTS-FILE
                KEY IS INCLUSION-DATE
                NOT INVALID KEY PERFORM 0600-DISPLAY-STUDENT-RECORD
           END-READ.
           PERFORM UNTIL FILE-CHECK-KEY NOT= "00"
               READ STUDENTS-FILE
                   NEXT RECORD
                   NOT INVALID KEY PERFORM 0600-DISPLAY-STUDENT-RECORD
               END-READ
           END-PERFORM.
       0600-DISPLAY-STUDENT-RECORD.
           ADD 1 TO WS-STUDENT-COUNT.
           MOVE STUDENT-ID TO REPORT-STUDENT-ID.
           MOVE STUDENT-NAME TO REPORT-STUDENT-NAME.
           MOVE STUDENT-BIRTHDAY TO REPORT-STUDENT-BDAY.
           MOVE STUDENT-COURSE TO REPORT-COURSE.
           MOVE UPDATE-DATE TO REPORT-REC-UPDATE-DATE.
           DISPLAY REPORT-RECORD.

       9000-END-PROGRAM.
           CLOSE STUDENTS-FILE.
           GOBACK.
       END PROGRAM PRGQ0007.
