       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGQ0005.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT STUDENTS-FILE ASSIGN TO "STUDENTS_INDEXED.DAT"
        FILE STATUS IS FILE-CHECK-KEY
        ORGANISATION IS INDEXED
        ACCESS IS DYNAMIC
        RECORD KEY IS STUDENT-ID
        ALTERNATE RECORD KEY IS INCLUSION-DATE WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENTS-FILE.
       01 STUDENT-DATA.
           88 END-OF-FILE VALUE HIGH-VALUE.
           05 STUDENT-ID PIC 9(4).
           05 STUDENT-NAME PIC X(25).
           05 STUDENT-BIRTHDAY PIC 9(8).
           05 STUDENT-COURSE PIC X(15).
           05 INCLUSION-DATE PIC 9(8).
           05 UPDATE-DATE PIC 9(8).
       WORKING-STORAGE SECTION.
       01 WS-AREA.
           05 FILE-CHECK-KEY PIC x(2).
           05 REPORT-SEPERATOR.
               10 FILLER PIC X(91) VALUE "------------------------------
      -        "--------------------------------------------------------
      -        "-----".
           05 REPORT-TITLE.
               10 FILLER PIC X(32) VALUE SPACES.
               10 FILLER PIC X(23) VALUE "C L A S S   R E P O R T".
               10 FILLER PIC X(36) VALUE SPACES.
           05 REPORT-HEADER.
               10 FILLER PIC X VALUE SPACES.
               10 FILLER PIC X(2) VALUE "ID".
               10 FILLER PIC X(3) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X(12) VALUE "STUDENT NAME".
               10 FILLER PIC X(14) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X(8) VALUE "BIRTHDAY".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X(6) VALUE "COURSE".
               10 FILLER PIC X(10) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X(11) VALUE "INSERT DATE".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X(11) VALUE "UPDATE DATE".
               10 FILLER PIC X(1) VALUE SPACES.
           05 REPORT-RECORD.
               10 FILLER PIC X VALUE SPACES.
               10 REPORT-STUDENT-ID PIC 9(4).
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 REPORT-STUDENT-NAME PIC X(25).
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 REPORT-STUDENT-BDAY PIC 9(8).
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 REPORT-COURSE PIC X(15).
               10 FILLER PIC X(1) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 REPORT-REC-INCLUSION-DATE PIC 9(8).
               10 FILLER PIC X(4) VALUE SPACES.
               10 FILLER PIC X VALUE "|".
               10 FILLER PIC X(1) VALUE SPACES.
               10 REPORT-REC-UPDATE-DATE PIC 9(8).
               10 FILLER PIC X(4) VALUE SPACES.
           05 REPORT-TOTAL-LINE.
               10 FILLER PIC X(17) VALUE "TOTAL STUDENTS : ".
               10 REPORT-TOTAL PIC ZZ9.
           05 WS-RECORD-COUNT PIC 999.
       PROCEDURE DIVISION.
       0100-START.
            PERFORM 0200-DISPLAY-REPORT.
            PERFORM 9000-END-PROGRAM.
       0200-DISPLAY-REPORT.
           OPEN INPUT STUDENTS-FILE.
           IF(FILE-CHECK-KEY NOT= "00")
               DISPLAY "ERROR OPENING FILE, STATUS ", FILE-CHECK-KEY
               PERFORM 9000-END-PROGRAM
           END-IF.
           DISPLAY REPORT-SEPERATOR.
           DISPLAY REPORT-TITLE.
           DISPLAY REPORT-SEPERATOR.
           DISPLAY REPORT-HEADER.
           DISPLAY REPORT-SEPERATOR.
           READ STUDENTS-FILE
            AT END SET END-OF-FILE TO TRUE
           END-READ.
           INITIALISE WS-RECORD-COUNT.
           PERFORM 0300-DISPLAY-RECORD UNTIL END-OF-FILE.
           DISPLAY REPORT-SEPERATOR.
           MOVE WS-RECORD-COUNT TO REPORT-TOTAL.
           DISPLAY REPORT-TOTAL-LINE.
           PERFORM 9000-END-PROGRAM.
       0300-DISPLAY-RECORD.
           ADD 1 TO WS-RECORD-COUNT.
           MOVE STUDENT-ID TO REPORT-STUDENT-ID.
           MOVE STUDENT-NAME TO REPORT-STUDENT-NAME.
           MOVE STUDENT-BIRTHDAY TO REPORT-STUDENT-BDAY.
           MOVE STUDENT-COURSE TO REPORT-COURSE.
           MOVE INCLUSION-DATE TO REPORT-REC-INCLUSION-DATE.
           MOVE UPDATE-DATE TO REPORT-REC-UPDATE-DATE.
           DISPLAY REPORT-RECORD.
           READ STUDENTS-FILE
            AT END SET END-OF-FILE TO TRUE
           END-READ.
       9000-END-PROGRAM.
           CLOSE STUDENTS-FILE.
            GOBACK.
       END PROGRAM PRGQ0005.
