       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGR0008.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       SELECT STUDENTS-FILE ASSIGN TO "STUDENTS_INDEXED.DAT"
        FILE STATUS IS FILE-CHECK-KEY
        ORGANISATION IS INDEXED
        ACCESS IS SEQUENTIAL
        RECORD KEY IS STUDENT-ID
        ALTERNATE RECORD KEY IS INCLUSION-DATE WITH DUPLICATES.
       SELECT REPORT-FILE ASSIGN TO "REPORT.DAT"
        ORGANIZATION IS LINE SEQUENTIAL.
       SELECT WORK-FILE ASSIGN TO "WORK.TMP".
       DATA DIVISION.
       FILE SECTION.
       FD STUDENTS-FILE.
       01 STUDENT-DATA.
           88 END-OF-FILE VALUE HIGH-VALUE.
           05 STUDENT-ID PIC 9(4).
           05 STUDENT-NAME PIC X(25).
           05 STUDENT-BIRTHDAY PIC 9(8).
           05 STUDENT-COURSE PIC X(15).
           05 INCLUSION-DATE PIC 9(8).
           05 UPDATE-DATE PIC 9(8).
       FD REPORT-FILE.
       01 REPORT-DATA.
           05 REPORT-LINE PIC X(73).
       SD WORK-FILE.
       01 WORK-FILE-DATA.
           88 NO-MORE-RECORD VALUE HIGH-VALUE.
           05 WORKFILE-STUDENT-ID PIC 9(4).
           05 WORKFILE-STUDENT-NAME PIC X(25).
           05 WORKFILE-STUDENT-BIRTHDAY PIC 9(8).
           05 WORKFILE-STUDENT-COURSE PIC X(15).
           05 WORKFILE-INCLUSION-DATE PIC 9(8).
           05 WORKFILE-UPDATE-DATE PIC 9(8).

       WORKING-STORAGE SECTION.
       01 WS-AREA.
           05 FILE-CHECK-KEY PIC X(2).
           05 DETAIL-REPORT.
            10 REPORT-SEPARATOR PIC X(91) VALUE "-----------------------
      -        "------------------------------------------------------".
            10 REPORT-TITLE.
                15 FILLER PIC X(32) VALUE SPACES.
                15 FILLER PIC X(23) VALUE "C L A S S   R E P O R T".
            10 REPORT-SECTION-TITLE.
               15 FILLER PIC X(3) VALUE SPACES.
               15 FILLER PIC X(7) VALUE "COURSE:".
               15 FILLER PIC X VALUE SPACE.
               15 REPORT-COURSE PIC X(15).
            10 REPORT-HEADER.
               15 FILLER PIC X VALUE SPACES.
               15 FILLER PIC X(2) VALUE "ID".
               15 FILLER PIC X(3) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(12) VALUE "STUDENT NAME".
               15 FILLER PIC X(14) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(8) VALUE "BIRTHDAY".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(11) VALUE "INSERT DATE".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X(11) VALUE "UPDATE DATE".
               15 FILLER PIC X(1) VALUE SPACES.
             10 REPORT-RECORD.
               15 FILLER PIC X VALUE SPACES.
               15 REPORT-STUDENT-ID PIC 9(4).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-STUDENT-NAME PIC X(25).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-STUDENT-BDAY PIC 9(8).
               15 FILLER PIC X(1) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-REC-INSERT-DATE PIC 9(8).
               15 FILLER PIC X(4) VALUE SPACES.
               15 FILLER PIC X VALUE "|".
               15 FILLER PIC X(1) VALUE SPACES.
               15 REPORT-REC-UPDATE-DATE PIC 9(8).
               15 FILLER PIC X(4) VALUE SPACES.
               15 FILLER PIC X(4) VALUE SPACES.
             10 REPORT-TOTAL-LINE.
               15 FILLER PIC X(17) VALUE "TOTAL STUDENTS : ".
               15 REPORT-TOTAL PIC ZZ9.
           05 WS-STUDENT-COUNT PIC 999.
           05 COURSE-NAME PIC X(15).
       PROCEDURE DIVISION.
       0100-START.
           OPEN OUTPUT REPORT-FILE.
           PERFORM 0200-WRITE-REPORT.
           PERFORM 9000-END-PROGRAM.
       0200-WRITE-REPORT.
           MOVE REPORT-SEPARATOR TO REPORT-LINE.
           WRITE REPORT-DATA AFTER ADVANCING 1 LINE.
           MOVE REPORT-TITLE TO REPORT-LINE.
           WRITE REPORT-DATA AFTER ADVANCING 1 LINE.
           SORT WORK-FILE ON ASCENDING KEY WORKFILE-STUDENT-COURSE
               USING STUDENTS-FILE
               OUTPUT PROCEDURE IS 0300-OUTPUT-PROC.
           MOVE WS-STUDENT-COUNT TO REPORT-TOTAL.
           MOVE REPORT-TOTAL-LINE TO REPORT-DATA.
           WRITE REPORT-DATA AFTER ADVANCING 2 LINE.
       0300-OUTPUT-PROC.
           RETURN WORK-FILE
               AT END SET NO-MORE-RECORD TO TRUE
           END-RETURN.
           PERFORM WITH TEST BEFORE UNTIL NO-MORE-RECORD
               IF SORT-RETURN = 0 THEN
                   ADD 1 TO WS-STUDENT-COUNT
                   IF WORKFILE-STUDENT-COURSE NOT= COURSE-NAME
                       THEN
                       IF REPORT-COURSE NOT= SPACES THEN
                           MOVE SPACES TO REPORT-DATA
                           WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                       END-IF
                       MOVE WORKFILE-STUDENT-COURSE TO COURSE-NAME
                       MOVE WORKFILE-STUDENT-COURSE TO REPORT-COURSE
                       MOVE REPORT-SECTION-TITLE TO REPORT-LINE
                       WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                       MOVE REPORT-SEPARATOR TO REPORT-LINE
                       WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                       MOVE REPORT-HEADER TO REPORT-LINE
                       WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                       MOVE REPORT-SEPARATOR TO REPORT-LINE
                       WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                   END-IF
                   MOVE WORKFILE-STUDENT-ID TO REPORT-STUDENT-ID
                   MOVE WORKFILE-STUDENT-NAME TO REPORT-STUDENT-NAME
                   MOVE WORKFILE-STUDENT-BIRTHDAY TO REPORT-STUDENT-BDAY
                   MOVE WORKFILE-INCLUSION-DATE
                       TO REPORT-REC-INSERT-DATE
                   MOVE WORKFILE-UPDATE-DATE TO REPORT-REC-UPDATE-DATE
                   MOVE REPORT-RECORD TO REPORT-LINE
                   WRITE REPORT-DATA AFTER ADVANCING 1 LINE
                   RETURN WORK-FILE
                       AT END SET NO-MORE-RECORD TO TRUE
               END-IF
           END-PERFORM.
       9000-END-PROGRAM.
           CLOSE REPORT-FILE.
           GOBACK.
       END PROGRAM PRGR0008.
