       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGV0001.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT STUDENT-SEQ ASSIGN TO "STUDENTS_SEQ.DAT"
            FILE STATUS IS FILE-CHECK-KEY-SEQ
            ORGANIZATION IS LINE SEQUENTIAL.
           SELECT STUDENT-VSAM ASSIGN TO "STUDENTS_INDEXED.DAT"
            FILE STATUS IS FILE-CHECK-KEY-INDEXED
            ORGANIZATION IS INDEXED
            ACCESS MODE IS RANDOM
            RECORD KEY IS STUDENT-ID
            ALTERNATE RECORD KEY IS INCLUSION-DATE WITH DUPLICATES.
       DATA DIVISION.
       FILE SECTION.
       FD STUDENT-SEQ.
        01 STUDENT-DATA-HEADER PIC X(54).
        01 STUDENT-DATA-SEC REDEFINES STUDENT-DATA-HEADER.
            88 END-OF-FILE VALUE HIGH-VALUE.
            05 SEQ-STUDENT-RECORD.
             10 SEQ-STUDENT-ID PIC 9(4).
             10 FILLER PIC X.
             10 SEQ-STUDENT-NAME PIC X(19).
             10 FILLER PIC X.
             10 SEQ-STUDENT-BIRTHDAY PIC 9(8).
             10 FILLER PIC X.
             10 SEQ-STUDENT-COURSE PIC X(20).

       FD STUDENT-VSAM.
        01 STUDENT-DATA-INDEXED.
            05 STUDENT-RECORD.
             10 STUDENT-ID PIC 9(4).
             10 STUDENT-NAME PIC X(25).
             10 STUDENT-BIRTHDAY PIC 9(8).
             10 STUDENT-COURSE PIC X(15).
             10 INCLUSION-DATE PIC 9(8).
             10 UPDATE-DATE PIC 9(8).
       WORKING-STORAGE SECTION.
       01 WS-AREA.
           05 FILE-CHECK-KEY-SEQ PIC X(2).
           05 FILE-CHECK-KEY-INDEXED PIC X(2).

        01  WS-CURRENT-DATE-FIELDS.
         05  WS-CURRENT-DATE.
          10  WS-CURRENT-YEAR    PIC  9(4).
          10  WS-CURRENT-MONTH   PIC  9(2).
          10  WS-CURRENT-DAY     PIC  9(2).
         05  FILLER PIC X(12).
       PROCEDURE DIVISION.
       0100-START.
            OPEN INPUT STUDENT-SEQ.
            OPEN OUTPUT STUDENT-VSAM.
            IF FILE-CHECK-KEY-SEQ NOT= "00"
                DISPLAY "ERROR OPENING INPUT FILE, CODE: ",
                 FILE-CHECK-KEY-SEQ
                PERFORM 9000-END-PROGRAM
            END-IF.
            PERFORM 0200-PROCESS-HEADER.
            READ STUDENT-SEQ
             AT END SET END-OF-FILE TO TRUE
            END-READ.
            PERFORM 0300-PROCESS-RECORD UNTIL END-OF-FILE.
            PERFORM 9000-END-PROGRAM.
       0200-PROCESS-HEADER.
            READ STUDENT-SEQ
             AT END SET END-OF-FILE TO TRUE
            END-READ.
       0300-PROCESS-RECORD.
            MOVE SEQ-STUDENT-ID TO STUDENT-ID.
            MOVE SEQ-STUDENT-NAME TO STUDENT-NAME.
            MOVE SEQ-STUDENT-BIRTHDAY TO STUDENT-BIRTHDAY.
            MOVE SEQ-STUDENT-COURSE TO STUDENT-COURSE.
            MOVE FUNCTION CURRENT-DATE TO WS-CURRENT-DATE.
            MOVE WS-CURRENT-DATE TO INCLUSION-DATE.
            INITIALISE UPDATE-DATE.
            WRITE STUDENT-DATA-INDEXED
             INVALID KEY DISPLAY "INVALID KEY, STATUS: ",
              FILE-CHECK-KEY-INDEXED
            END-WRITE.
            READ STUDENT-SEQ
             AT END SET END-OF-FILE TO TRUE
            END-READ.

       9000-END-PROGRAM.
            CLOSE STUDENT-SEQ, STUDENT-VSAM.
            GOBACK.
       END PROGRAM PRGV0001.
