       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGD0004.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT DELFILE ASSIGN TO "DELFILE"
               FILE STATUS IS FILE-CHECK-KEY
               ORGANIZATION IS SEQUENTIAL.
           SELECT LOGFILE ASSIGN TO "LOGFILE"
               ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD DELFILE
           DATA RECORD IS STUDENT-RECORD.
       COPY STUDREC.
       FD LOGFILE.
       01 LOG-DATA.
           05 LOG-LINE PIC X(80).
       WORKING-STORAGE SECTION.
           EXEC SQL
               INCLUDE SQLCA
           END-EXEC.
           EXEC SQL
               INCLUDE TSTUDENT
           END-EXEC.
       01 WS-WORK-AREAS.
           05 FILE-CHECK-KEY PIC X(2).
           05 WS-STUDENT.
               10 WS-RID PIC X(4).
       PROCEDURE DIVISION.
       0100-START.
           OPEN INPUT DELFILE.
           IF (FILE-CHECK-KEY NOT = "00")
               DISPLAY "ERROR OPENING DATA FILE, CODE: ",
               FILE-CHECK-KEY
               MOVE FILE-CHECK-KEY TO RETURN-CODE
               PERFORM 9000-END-PROGRAM
           END-IF.
           PERFORM 0200-PROCESS-INPUT.
           PERFORM 9000-END-PROGRAM.
       0200-PROCESS-INPUT.
           PERFORM 0400-READ-NEXT.
           PERFORM 0300-DELETE-RECORD UNTIL ENDOFFILE.
       0300-DELETE-RECORD.
           EXEC SQL
               DELETE FROM TSTUDENT
                   WHERE STUD_ID = :WS-RID
           END-EXEC.
           IF SQLCODE NOT EQUAL +0
               DISPLAY "ERROR DELETING ID: ", WS-RID,
                   ", CODE: ",  SQLCODE
           END-IF.
           PERFORM 0400-READ-NEXT.
       0400-READ-NEXT.
           READ DELFILE
               AT END SET ENDOFFILE TO TRUE
           END-READ.
           MOVE RSTUD-ID TO WS-RID.
       9000-END-PROGRAM.
           CLOSE DELFILE.
            STOP RUN.
       END PROGRAM PRGD0004.
