       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGS0001.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT CONTROLFILE ASSIGN TO "CTRLFILE"
               FILE STATUS IS FILE-CHECK-KEY
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT DELFILE ASSIGN TO "DELFILE"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT INSFILE ASSIGN TO "INSFILE"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT UPDFILE ASSIGN TO "UPDFILE"
               ORGANIZATION IS LINE SEQUENTIAL.
           SELECT LOGFILE ASSIGN TO "LOGFILE"
               ORGANIZATION IS SEQUENTIAL.
       DATA DIVISION.
       FILE SECTION.
       FD CONTROLFILE
           DATA RECORD IS STUDENT-RECORD.
       COPY STUDREC.
           05 FILLER PIC X(11).
       FD DELFILE.
       01 DEL-DATA.
           05 FILLER PIC X(69).
       FD INSFILE.
       01 INS-DATA.
           05 FILLER PIC X(69).
       FD UPDFILE.
       01 UPD-DATA.
           05 FILLER PIC X(69).
       FD LOGFILE.
       01 LOG-DATA.
           05 LOG-LINE PIC X(80).
       WORKING-STORAGE SECTION.
       01 WS-WORK-AREAS.
           05 FILE-CHECK-KEY PIC X(2).
           05 FILE-ERROR.
               10 FILLER PIC X(34)
               VALUE "ERROR OPENING CONTROL FILE, CODE: ".
               10 FILE-ERROR-CODE PIC X(2).
           05 OP-CODE-ERROR.
               10 FILLER PIC X(17) VALUE "INVALID OP CODE: ".
               10 OP-CODE-ERROR-CODE PIC X(2).
           05 SUMMARY-LINE.
               10 SUM-TOTAL-COUNT PIC ZZZ9.
               10 FILLER PIC X(18) VALUE " LINES PROCESSED. ".
               10 SUM-ERROR-COUNT PIC ZZZ9.
               10 FILLER PIC X(8) VALUE " ERRORS.".
           05 WS-TOTAL-COUNT PIC 9(4) VALUE ZERO.
           05 WS-ERROR-COUNT PIC 9(4) VALUE ZERO.
       PROCEDURE DIVISION.
       0100-START.
           OPEN INPUT CONTROLFILE.
           OPEN OUTPUT DELFILE, INSFILE, UPDFILE, LOGFILE.
           IF (FILE-CHECK-KEY NOT = "00")
               MOVE FILE-CHECK-KEY TO FILE-ERROR-CODE
               MOVE FILE-ERROR TO LOG-LINE
               WRITE LOG-DATA
               MOVE FILE-CHECK-KEY TO RETURN-CODE
               PERFORM 9000-END-PROGRAM
           END-IF.
           READ CONTROLFILE
               AT END SET ENDOFFILE TO TRUE
           END-READ.
           PERFORM 0200-SPLIT-FILE UNTIL ENDOFFILE.
           PERFORM 0300-LOG-SUMMARY.
           PERFORM 9000-END-PROGRAM.
       0200-SPLIT-FILE.
           ADD 1 TO WS-TOTAL-COUNT.
           IF (RSTUD-OP-CODE = "D")
               WRITE DEL-DATA FROM STUDENT-RECORD
           ELSE IF (RSTUD-OP-CODE = "I")
               WRITE INS-DATA FROM STUDENT-RECORD
           ELSE IF (RSTUD-OP-CODE = "U")
               WRITE UPD-DATA FROM STUDENT-RECORD
           ELSE
               ADD 1 TO WS-ERROR-COUNT
               MOVE RSTUD-OP-CODE TO OP-CODE-ERROR-CODE
               MOVE OP-CODE-ERROR TO LOG-LINE
               WRITE LOG-DATA
           END-IF.
           READ CONTROLFILE
               AT END SET ENDOFFILE TO TRUE
           END-READ.
       0300-LOG-SUMMARY.
           MOVE WS-TOTAL-COUNT TO SUM-TOTAL-COUNT.
           MOVE WS-ERROR-COUNT TO SUM-ERROR-COUNT.
           WRITE LOG-DATA FROM SUMMARY-LINE.
       9000-END-PROGRAM.
           CLOSE CONTROLFILE, DELFILE, INSFILE, UPDFILE, LOGFILE.
           STOP RUN.
       END PROGRAM PRGS0001.
